{
    "abstract": "We consider a novel application of inverse reinforcement learning with behavioral economics constraints to model, learn and predict the commenting behavior of YouTube viewers. Each group of users is modeled as a rationally inattentive Bayesian agent which solves a contextual bandit problem. Our methodology integrates three key components. First, to identify distinct commenting patterns, we use deep embedded clustering to estimate framing information (essential extrinsic  features) that clusters users into distinct groups. Second, we present an inverse reinforcement learning algorithm that uses Bayesian revealed preferences to test for rationality: does there exist a utility function that rationalizes the given data, and if yes, can it be used to predict commenting behavior? Finally, we impose behavioral economics constraints stemming from rational inattention to characterize the attention span of groups of users. The test imposes a Renyi mutual information cost constraint which impacts how the agent can select attention strategies to maximize their expected utility. After a careful analysis of a massive YouTube dataset, our surprising result is that in most YouTube user groups, the commenting behavior is consistent with optimizing a Bayesian utility with rationally inattentive constraints. The paper also highlights how the rational inattention model can accurately predict commenting behavior. The massive YouTube dataset and analysis used in this paper are available on GitHub and completely reproducible.",
    "authors": [
        "William Hoiles",
        "Vikram Krishnamurthy",
        "Kunal Pattanayak"
    ],
    "emails": [
        "william.hoiles@katerra.com",
        "vikramk@cornell.edu",
        "kp487@cornell.edu"
    ],
    "id": "19-872",
    "issue": 170,
    "pages": [
        1,
        39
    ],
    "title": "Rationally Inattentive Inverse Reinforcement Learning Explains YouTube Commenting Behavior",
    "volume": 21,
    "year": 2020
}