{
    "abstract": "Peak detection in genomic data involves segmenting counts of DNA sequence reads aligned to different locations of a chromosome. The goal is to detect peaks with higher counts, and filter out background noise with lower counts. Most existing algorithms for this problem are unsupervised heuristics tailored to patterns in specific data types. We propose a supervised framework for this problem, using optimal changepoint detection models with learned penalty functions. We propose the first dynamic programming algorithm that is guaranteed to compute the optimal solution to changepoint detection problems with constraints between adjacent segment mean parameters. Implementing this algorithm requires the choice of penalty parameter that determines the number of segments that are estimated. We show how the supervised learning ideas of Rigaill et al. (2013) can be used to choose this penalty. We compare the resulting implementation of our algorithm to several baselines in a benchmark of labeled ChIP-seq data sets with two different patterns (broad H3K36me3 data and sharp H3K4me3 data). Whereas baseline unsupervised methods only provide accurate peak detection for a single pattern, our supervised method achieves state-of-the-art accuracy in all data sets. The log-linear timings of our proposed dynamic programming algorithm make it scalable to the large genomic data sets that are now common. Our implementation is available in the PeakSegOptimal R package on CRAN.",
    "authors": [
        "Toby Dylan Hocking",
        "Guillem Rigaill",
        "Paul Fearnhead",
        "Guillaume Bourque"
    ],
    "emails": [
        "toby.hocking@nau.edu",
        "guillem.rigaill@inrae.fr",
        "p.fearnhead@lancaster.ac.uk",
        "guil.bourque@mcgill.ca"
    ],
    "extra_links": [
        [
            "code",
            "https://github.com/tdhock/PeakSegFPOP-paper"
        ]
    ],
    "id": "18-843",
    "issue": 87,
    "pages": [
        1,
        40
    ],
    "title": "Constrained Dynamic Programming and Supervised Penalty Learning Algorithms for Peak Detection in Genomic Data",
    "volume": 21,
    "year": 2020
}