{
    "abstract": "We consider the problem of jointly estimating multiple inverse covariance matrices from high-dimensional data consisting of distinct classes. An $\\ell_2$-penalized maximum likelihood approach is employed. The suggested approach is flexible and generic, incorporating several other $\\ell_2$-penalized estimators as special cases. In addition, the approach allows specification of target matrices through which prior knowledge may be incorporated and which can stabilize the estimation procedure in high-dimensional settings. The result is a targeted fused ridge estimator that is of use when the precision matrices of the constituent classes are believed to chiefly share the same structure while potentially differing in a number of locations of interest. It has many applications in (multi)factorial study designs. We focus on the graphical interpretation of precision matrices with the proposed estimator then serving as a basis for integrative or meta-analytic Gaussian graphical modeling. Situations are considered in which the classes are defined by data sets and subtypes of diseases. The performance of the proposed estimator in the graphical modeling setting is assessed through extensive simulation experiments. Its practical usability is illustrated by the differential network modeling of 12 large-scale gene expression data sets of diffuse large B-cell lymphoma subtypes. The estimator and its related procedures are incorporated into the R-package rags2ridges.",
    "authors": [
        "Anders Ellern Bilgrau",
        "Carel F.W. Peeters",
        "Poul Svante Eriksen",
        "Martin Boegsted",
        "Wessel N. van Wieringen"
    ],
    "emails": [
        "anders.ellern.bilgrau@gmail.com",
        "cf.peeters@amsterdamumc.nl",
        "svante@math.aau.dk",
        "m_boegsted@dcm.aau.dk",
        "w.vanwieringen@amsterdamumc.nl"
    ],
    "id": "15-509",
    "issue": 26,
    "pages": [
        1,
        52
    ],
    "title": "Targeted Fused Ridge Estimation of Inverse Covariance Matrices from Multiple High-Dimensional Data Classes",
    "volume": 21,
    "year": 2020
}