{
    "abstract": "We propose a new stochastic first-order algorithmic framework to solve stochastic  composite nonconvex optimization problems that covers both finite-sum and expectation settings. Our algorithms rely on the SARAH estimator and consist of two steps: a proximal gradient and an averaging step making them different from existing nonconvex proximal-type algorithms. The algorithms only require an average smoothness assumption of the nonconvex objective term and additional bounded variance assumption if applied to expectation problems. They work with both constant and dynamic step-sizes, while allowing single sample and mini-batches. In all these cases, we prove that our algorithms can achieve the best-known complexity bounds in terms of stochastic first-order oracle. One key step of our methods is the new constant and dynamic step-sizes resulting in the desired complexity bounds while improving practical performance. Our constant step-size is much larger than existing methods including proximal SVRG scheme in the single sample case. We also specify our framework to the non-composite case that covers existing state-of-the-arts in terms of oracle complexity bounds. Our update also allows one to trade-off between step-sizes and mini-batch sizes to improve performance. We test the proposed algorithms on two composite nonconvex problems and neural networks using several well-known data sets.",
    "authors": [
        "Nhan H. Pham",
        "Lam M. Nguyen",
        "Dzung T. Phan",
        "Quoc Tran-Dinh"
    ],
    "emails": [
        "nhanph@live.unc.edu",
        "lamnguyen.mltd@ibm.com",
        "phandu@us.ibm.com",
        "quoctd@email.unc.edu"
    ],
    "extra_links": [
        [
            "code",
            "https://github.com/unc-optimization/StochasticProximalMethods"
        ]
    ],
    "id": "19-248",
    "issue": 110,
    "pages": [
        1,
        48
    ],
    "title": "ProxSARAH: An Efficient Algorithmic Framework for Stochastic Composite Nonconvex Optimization",
    "volume": 21,
    "year": 2020
}